Revit 2027 API
TopographyEditScope Class
 A TopographyEditScope allows an application to create and maintain an editing session for a TopographySurface.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.EditScope
 Autodesk.Revit.DB.Architecture.TopographyEditScope
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TopographyEditScope : EditScope
Public Class TopographyEditScope
	Inherits EditScope
public ref class TopographyEditScope : public EditScope
type TopographyEditScope =
    class
        inherit EditScope
    end
The TopographyEditScope type exposes the following members.
Constructors
Name | Description
TopographyEditScope |  Instantiates a TopographyEditScope object.
Top
Properties
Name | Description
IsActive |  Tells if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet.
(Inherited from EditScope)
IsPermitted |  Tells if the edit scope is permitted to start.
(Inherited from EditScope)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from EditScope)
Top
Methods
Name | Description
Cancel |  Cancels the edit scope.
(Inherited from EditScope)
Commit |  Finishes the edit scope.
(Inherited from EditScope)
Dispose
(Inherited from EditScope)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Start |  Starts a topography surface edit mode for an existing TopographySurface element.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 Start/end of a TopographyEditScope will start/end a transaction group. After a TopographyEditScope is started, an application can start transactions and edit the topography surface. Individual transactions the application creates inside TopographyEditScope will not appear in the undo menu. All transactions committed during the edit mode will be merged into a single one which will bear the given name passed into TopographyEditScope constructor.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace